<a href="https://colab.research.google.com/github/engineercha/ai-class/blob/master/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

##Data Frame

정의 이전에 dataframe에 들어갈 데이터를 정의해야 하는데, 파이썬의 dictionary 또는 numpy의 array로 정의할 수 있다.

In [ ]:
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [ ]:
# 행 방향의 index
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
# 열 방향의 index
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [ ]:
# 값 얻기
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [ ]:
# 각 인덱스에 이름 설정하기
df.index.name='Num'
df.columns.name='Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

##NaN

null과 같은 개념

##DataFrame Indexing

In [ ]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
        "year": [2014, 2015, 2016, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                        index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [ ]:
# DataFrame에서 열을 선택하고 조작하기
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [ ]:
# 특정 열을 선택하고, 원하는 값을 대입하기
df['penalty'] = 0.5
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [ ]:
# 또는
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5] # 파이썬의 List나 numpy의 array
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [ ]:
# 열 추가하기
df['zeros'] = np.arange(5) # arange(5)는 0에서 5에서 멈추는, 0~4에 해당하는 5개의 데이터를 의미
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

Series로 데이터를 DataFrame에 넣을 때는 "넣으려는 data의 index에 맞춰서" 알아서 들어간다.

In [ ]:
df['net_points'] = df['points'] - df['penalty']
df['high_points'] = df['points'] > 2.0
df

       year    names  points  penalty  zeros  net_points  high_points
one    2014    Kilho     1.5      0.1      0         1.4        False
two    2015    Kilho     1.7      0.2      1         1.5        False
three  2016    Kilho     3.6      0.3      2         3.3         True
four   2015  Charles     2.4      0.4      3         2.0         True
five   2016  Charles     2.9      0.5      4         2.4         True

In [ ]:
# 열 삭제하기
del df['zeros']
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5